<template>
  <div id="app">

    <div id="message" class="note full-rotate border border-primary">
      <p><a href="/">主页</a></p>
      <h1>隐私政策</h1>
      <p>本政策适用于本网站收集或提交给本网站的所有信息treehole.site。</p>

      <p>未经您的同意，我们不会将您的个人信息透露给外界。</p>

      <p>treehole.site只保存您的留言内容，而不保存PII。我们也会收集用于报告、管理和点赞的信息。为了控制垃圾邮件，IP地址的保存时间不会超过30天。</p>

      <p>广告和跟踪</p>
      <p>我们在网站上没有任何广告，也不使用任何第三方分析数据。</p>

      <p>安全性</p>
      <p>我们实施了各种安全措施来帮助保证您的信息安全。例如，与应用程序和网站的所有通信都需要HTTPS。密码使用行业标准的方法进行哈希，而不是存储。</p>

      <p>数据访问、更改和删除</p>
      <p>treehole.site上没有账号。如果你有信息想删除，请在留言中报告。被删除的信息可能会在短时间内进行备份，以方便灾难恢复。</p>

      <p>本网站自毁网可能会在任何时候、以任何理由删除您的信息，如技术需要、法律问题、防止滥用、删除闲置账户、数据丢失或其他原因。</p>

      <p>国外合规信息</p>
      <p>信息可能会在您所在的国家之外处理、存储和使用。各个司法管辖区的数据隐私法各不相同，根据处理、存储或使用您的数据的地点，可能会有不同的法律适用。</p>

      <p>使用treehole.site并提供您的信息，即表示您授权我们在欧盟以外的地区收集、使用和存储您的信息。</p>

      <p>我们从来不会在我们的网站上收集或维护那些我们实际知道的13岁以下的人的信息，我们网站的任何部分都不会吸引13岁以下的人。</p>

      <p>本政策</p>
      <p>使用treehole.site，即表示您同意我们的隐私政策。</p>

      <p>如果您对本隐私政策有疑问，请发电子邮件至 547605677@qq.com。</p>

      <p>如果我们决定改变我们的隐私政策，我们将在本页公布这些变化，以及变化的摘要。</p>

      <p>更新</p>
      <p>2020年7月8日 - 澄清我们没有广告或使用分析数据。</p>
    </div>
  </div>
</template>

<script>
    export default {
        name: "Privacy"
    }
</script>

<style scoped>

</style>
